Web prettify and readme
